---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorRecreateFailedWarning
source: html/fbbaaf4f-e89a-3190-f023-14c48eafa48f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorRecreateFailedWarning Property

The floor cannot be created because no suitable level in the target document can be found.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorRecreateFailedWarning { get; }
```